---
type: ModelCurveArrArrayIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ModelCurveArrArrayIterator

`Autodesk.Revit.DB.ModelCurveArrArrayIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ModelCurveArrArrayIterator | — | `public ModelCurveArrArrayIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |